Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>RUNCFG</name>
          <description>Run Configuration</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000F502</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMP_MAINCLK_SHUTOFF</name>
              <description>VDD2_COMP Domain compute_main_clk Shut Off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSEP_MAINCLK_SHUTOFF</name>
              <description>VDD1_SENSE Domain sense_main_clk Shut Off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SENMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SENMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SENSES_MAINCLK_SHUTOFF</name>
              <description>VDD1_SENSE Domain sense_main_clk_1 Shut Off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMMCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM0_CLK_SHUTOFF</name>
              <description>RAM_ARBITER0 common_ram_clk Shut Off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM0MCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM0MCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM1_CLK_SHUTOFF</name>
              <description>RAM_ARBITER1 sense_ram_clk shut off</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM1CLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM1MCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMN_MAINCLK_SHUTOFF</name>
              <description>VDDN_COM Domain common_vddn_clk Shut Off</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMNN_MCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMNN_MCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEDIA_MAINCLK_SHUTOFF</name>
              <description>VDD2_MEDIA and VDDN_MEDIA Domains media_main_clk and media_vddn_clk Shut Off</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEDCLK_ON</name>
                  <description>Turns on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDCLK_OFF</name>
                  <description>Turns off</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_PD</name>
              <description>Xtal Oscillator Power Down</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSXTAL_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSXTAL_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO0_PD</name>
              <description>FRO0 Power Down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO0_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO0_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO1_PD</name>
              <description>FRO1 Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO1_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO1_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2_PD</name>
              <description>FRO2 Power Down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOSC_PD</name>
              <description>LPOSC Power Down</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSC_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLANA_PD</name>
              <description>Main PLL Analog Function Power Down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLLANA_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLANA_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLLDO_PD</name>
              <description>Main PLL Internal Regulator Power Down</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLLLDO_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLLDO_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDPLLANA_PD</name>
              <description>Audio PLL Analog Function Power Down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APLLANA_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APLLANA_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDPLLLDO_PD</name>
              <description>Audio PLL Internal Regulator Power Down</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APLLLDO_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APLLLDO_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0_PD</name>
              <description>ADC0 Power Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0_EN</name>
                  <description>Powers on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_PD</name>
                  <description>Powers down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO0_GATE</name>
              <description>FRO0 Gating</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO_NOGATE</name>
                  <description>Removes gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO0_GATE</name>
                  <description>Applies gating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO2_GATE</name>
              <description>FRO2 Gating</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO2_NOGATE</name>
                  <description>Removes gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO2_GATE</name>
                  <description>Applies gating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
