Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>PRIVATE_TCTRL2</name>
          <description>Private Resources Targets Low-power Control 2</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0_LPREQ</name>
              <description>GPIO0 Low-Power Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1_LPREQ</name>
              <description>GPIO1 Low-Power Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2_LPREQ</name>
              <description>GPIO2 Low-Power Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3_LPREQ</name>
              <description>GPIO3 Low-Power Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO4_LPREQ</name>
              <description>GPIO4 Low-Power Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO5_LPREQ</name>
              <description>GPIO5 Low-Power Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO6_LPREQ</name>
              <description>GPIO6 Low-Power Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO7_LPREQ</name>
              <description>GPIO7 Low-Power Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI0_LPREQ</name>
              <description>SAI0 Low-Power Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_LPREQ</name>
              <description>SAI1 Low-Power Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI2_LPREQ</name>
              <description>SAI2 Low-Power Request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNG_STOP</name>
              <description>TRNG Stop</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI0_STOP</name>
              <description>XSPI0 Stop</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XSPI1_STOP</name>
              <description>XSPI1 Stop</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C0_STOP</name>
              <description>I3C0 Stop</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C1_STOP</name>
              <description>I3C1 Stop</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDET0_LPREQ</name>
              <description>GDET0 Low-Power Request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_MED_CSTAT0</name>
          <description>Media Domain Shared Controllers Low-power Status</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VGPU_LPACCEPT</name>
              <description>VGPU Low-power Accept Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_NOQACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_LPACCEPT</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VGPU_IDLE</name>
              <description>VGPU Idle Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_QACTIVE</name>
                  <description>Not in Idle status, VGPU has operation to perform.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_QINACTIVE</name>
                  <description>In Idle status, VGPU might accept low-power request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_STOPPED</name>
              <description>EZH-V Stop Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NOSTOPPED</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_HALTED</name>
              <description>EZH-V Halt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NOHALTED</name>
                  <description>Not in Halt status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_HALTED</name>
                  <description>In Halt status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_WAITING</name>
              <description>EZH-V Waiting Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NO_WAITING</name>
                  <description>Not in waiting status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_WAITING</name>
                  <description>In waiting status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_WAKEUP</name>
              <description>Wakeup Request from EZH-V</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NO_WAKE</name>
                  <description>Not needs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_WAKE_REQ</name>
                  <description>Needs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
