Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>SHA_MEDSEN_TSTAT0</name>
          <description>Media and Sense Domain Shared Targets Low-power Status</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XSPI2_STOP</name>
              <description>XSPI2 Stop Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XSPI2_NOSTOP</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XSPI2_STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_B_LPACCEPT</name>
              <description>LPSPI14 Bus Low-power Accept Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI14_NOBUSACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI14_BUSACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI14_F_LPACCEPT</name>
              <description>LPSPI14 Function Low-power Accept Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI14_NOFACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI14_FACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_B_LPACCEPT</name>
              <description>LPSPI16 Bus Low-power Accept Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI16_NOBUSACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI16_BUSACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI16_F_LPACCEPT</name>
              <description>LPSPI16 Function Low-power Accept Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI16_NOFACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI16_FACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_B_LPACCEPT</name>
              <description>FLEXIO Bus Low-power Accept Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO_NOBACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_BACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_F_LPACCEPT</name>
              <description>FLEXIO Function Low-power Accept Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO_NOFACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_FACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIC0_LPACCEPT</name>
              <description>NIC_MEDIA0 Accept Low-power Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NIC0_NOACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NIC0_ACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIC1_LPACCEPT</name>
              <description>NIC_MEDIA1 Low-power Accept Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NIC1_NOACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NIC1_ACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0_STOP</name>
              <description>ADC0 Stop Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0_NOSTOP</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_STPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0_STOP</name>
              <description>ACMP0 Stop Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP0_NOSTP</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0_STPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MICFIL_STOPPED</name>
              <description>MICFIL Stop Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MICFIL_NOSTOP</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICFIL_STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_B_LPACCEPT</name>
              <description>LPI2C15 Bus Low-power Accept Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C15_NOBUSSTOP</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C15_B_LPACCEPT</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_F_LPACCEPT</name>
              <description>LPI2C15 Function Low-power Accept Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C15_NOFACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C15_FACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDET3_LPACCEPT</name>
              <description>GDET3 Low-power Accept Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GDET3_NOACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GDET3_ACK</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_STOPPED</name>
              <description>RTC0 and RTC1 Stop Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_NOSTOPPED</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVATE_CSTAT0</name>
          <description>Private Resources Controller Low-power Status</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDMA0_STOP</name>
              <description>eDMA0 Stop Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSTOPPED</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDMA1_STOP</name>
              <description>eDMA1 Stop Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSTOPPED</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
