Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GDET0</name>
      <description>no description available</description>
      <groupName>GDET</groupName>
      <headerStructName>GDET</headerStructName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GDET_ENABLE1</name>
          <description>Enable register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN1</name>
              <description>If set, the detector will request the reference clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFU</name>
              <description>Reserved for Future Use</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDET_DLY_CTRL</name>
          <description>GDET delay control register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOL_SEL</name>
              <description>GDET Delay Control of the Voltage Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_VOL_CTRL</name>
              <description>Select the control of the trim code to the delay line via HW port (0) or SW SFR (1)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFU</name>
              <description>Reserved for Future Use</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDET_CTRL_CLR</name>
          <description>GDET Clear Control register</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SFT_RST</name>
              <description>Soft reset for the core reset (SFR configuration will be preseved).This register reads as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GDET0">
      <name>GDET3</name>
      <description>no description available</description>
      <groupName>GDET</groupName>
      <baseAddress>0x4006B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>OCOTP</name>
      <description>no description available</description>
      <groupName>OCOTP</groupName>
      <baseAddress>0x40018000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x894</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OTP_SHADOW_PARTA[%s]</name>
          <description>OTP shadow register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 0-47 (offset should be 0*4-47*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB144</name>
          <description>OTP shadow register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB145</name>
          <description>OTP shadow register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB146</name>
          <description>OTP shadow register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB147</name>
          <description>OTP shadow register</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB148</name>
          <description>OTP shadow register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB149</name>
          <description>OTP shadow register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB150</name>
          <description>OTP shadow register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB151</name>
          <description>OTP shadow register</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB152</name>
          <description>OTP shadow register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB153</name>
          <description>OTP shadow register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB154</name>
          <description>OTP shadow register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB155</name>
          <description>OTP shadow register</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB156</name>
          <description>OTP shadow register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB157</name>
          <description>OTP shadow register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB158</name>
          <description>OTP shadow register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB159</name>
          <description>OTP shadow register</description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB160</name>
          <description>OTP shadow register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB161</name>
          <description>OTP shadow register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB162</name>
          <description>OTP shadow register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB163</name>
          <description>OTP shadow register</description>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB164</name>
          <description>OTP shadow register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB165</name>
          <description>OTP shadow register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB166</name>
          <description>OTP shadow register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB167</name>
          <description>OTP shadow register</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB168</name>
          <description>OTP shadow register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB169</name>
          <description>OTP shadow register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB170</name>
          <description>OTP shadow register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTP_SHADOW_PARTB171</name>
          <description>OTP shadow register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SHADOW</name>
              <description>OTP shadow register, fsb have read access of shadow 144-511 (offset should be 144*4-511*4)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
