Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>HW_OCOTP_CTRL</name>
          <description>OTP Controller Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>OTP word address for read/programming.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRNG_OUTPUT_DATA_EN</name>
              <description>Default is 0: enable read value of prng out data, disable read when set to 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM_ENTROPY_DATA_EN</name>
              <description>Default is 0: enable read value of sram entropy data, disable read when set to 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOAD_SHADOWS</name>
              <description>Set to force re-loading the shadow registers (HW/SW capability and LOCK)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RED_MUX_SEL</name>
              <description>For fuse word with Redundancy mode, if set red_mux_sel to 0, low 16bit fuse OR high 16bit fuse value can be read, if set red_mux_sel to 1, low 16bit fuse value can be read, if set red_mux_sel to 2, high 16bit fuse value can be read</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPPADD</name>
              <description>This bit should be set when programming pr reading the supplementary address space (aka test row).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORDLOCK</name>
              <description>Set to write-lock the fuse word when it's being programming.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_UNLOCK</name>
              <description>Write 0x3E77 to enable OTP write accesses</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_WRITE_DATA</name>
          <description>OTP Controller Write Data Register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRITE_DATA</name>
              <description>Fuse word programming data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_READ_CTRL</name>
          <description>OTP Controller Read Ctrl Register</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READ</name>
              <description>Writing 1 to start a fuse word read operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_READ_DATA</name>
          <description>OTP Controller Read Data Register</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>READ_DATA</name>
              <description>Fuse word read data from read operation.When write any value to it, it will be clear to all 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_STATUS</name>
          <description>OTP Controller Status Register</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOAD_COUNTER</name>
              <description>store load fuse number when load finished.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LC_NOT_BLANK_STICKY</name>
              <description>indicate lc not blank has been blown.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCKED</name>
              <description>OTP LOCKED status during read/write operation. Write 1 to clear.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROGFAIL</name>
              <description>OTP PROGFAIL status. Write 1 to clear.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK</name>
              <description>OTP ACK value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWOK</name>
              <description>OTP PWOK value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWOKFAIL</name>
              <description>OTP PWOK fail indicate</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLAGSTATE</name>
              <description>OTP FLAGSTATE[3:0] value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>OTP controller status bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUSE_LATCHED</name>
              <description>Indicate all shadows registers have been loaded with their corresponding fuse words when set by the controller after reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CALIBRATED</name>
              <description>OTP CALIBRATED status.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_VERSION</name>
          <description>OTP Controller Version Register</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_VER</name>
              <description>OTP controller step version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR_VER</name>
              <description>OTP controller minor version.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_VER</name>
              <description>OTP controller major version.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_OCOTP_NONMASK_STATUS1</name>
          <description>OTP Controller Nonmask Status1 Register</description>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NONMASK_PBRICK_ERR</name>
              <description>Asserted if ctrl_ocotp_nxp_zeroization_mask_fuse_wp and ctrl_ocotp_nxp_zeroization_mask_fuse_wp_n are both 0/1 OR ctrl_ocotp_oem_zeroization_mask_wp and ctrl_ocotp_oem_zeroization_mask_wp_n are both 0/1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_OTP_STATE_ERR</name>
              <description>Asserted if state machine go to invalid state. Set 1 to clear.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_DED_RELOAD</name>
              <description>OTP DED status during reload process. Set 1 to clear.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_DED</name>
              <description>OTP DED status during read operation. Set 1 to clear.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SEC_RELOAD</name>
              <description>OTP SEC status during reload process. Set 1 to clear.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SEC</name>
              <description>OTP SEC status during read operation. Set 1 to clear.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_CRC_DONE</name>
              <description>Asserted if CRC done. Set 1 to clear.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_CRC_LUT_SEL_ERR</name>
              <description>Asserted if CRC_LUT_SEL bits in CRC_CTRL register is out range ([1,8]) when CRC_RUN bit in CRC_CTRL register is set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_CRC_ADDRESS_RANGE_ERR</name>
              <description>Asserted if CRC_START_ADDR and CRC_END_ADDR bits in associated CRC_LUT register is out of range, both CRC_END_ADDR is smaller than CRC_START_ADDR OR CRC_SATRT_ADDR is larger than 124 OR CRC_END_ADDR is larger than 128 will cause out of range</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_CRC_WRITE_PROTECT_ERR</name>
              <description>Asserted if write access occurs when WRITE PROTECTION bit in associated CRC_LUT register is set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_CRC_SECURTY_PROTECT_ERR</name>
              <description>Asserted if not in secured state when SECURITY PROTECTION bit in associated CRC_LUT register is set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_WRITE_ERR</name>
              <description>Asserted if write glitch is detected. Set 1 to clear.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_LOAD_ERR</name>
              <description>Asserted if load glitch is detected. Set 1 to clear.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_COUNTER_ERR</name>
              <description>Asserted if load counter is not equal to fuse word number when load finished. Set 1 to clear.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_BITPROTECT_ERR</name>
              <description>Asserted if bit protect error is generated. Set 1 to clear.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_PRNG_O_FAULT</name>
              <description>Asserted if output signal o_default of prng module is not equal to 1. Set 1 to clear.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_ECC_ZEROIZED_ERR</name>
              <description>Asserted if zeroized fuse word is detetced. Set 1 to clear.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_FUSE_ACCESS_ERR</name>
              <description>Asserted if fuse read/prog operation occurs when lmda_ocotp_no_fuse_access equal to 1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_RELOAD_REQ_ERR</name>
              <description>Asserted if reload operation occurs when lmda_ocotp_no_reload equal to 1. Set 1 to clear.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_WRITE_DURING_RELOAD_ERR</name>
              <description>Asserted if writing operation occurs during reload. Set 1 to clear.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SHADOW_HVF_READ_ERR</name>
              <description>Asserted if shadow hvf read error is generated. Set 1 to clear.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SHADOW_HVF_WRITE_ERR</name>
              <description>Asserted if shadow hvf write error is generated. Set 1 to clear.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SHADOW_SRAM_READ_ERR</name>
              <description>Asserted if shadow sram read error is generated. Set 1 to clear.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SHADOW_SRAM_WRITE_ERR</name>
              <description>Asserted if shadow sram write error is generated. Set 1 to clear.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_FUSE_READ_ERR</name>
              <description>Asserted if fuse read error is generated. Set 1 to clear.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_FUSE_PROG_ERR</name>
              <description>Asserted if fuse prog error is generated. set 1 to clear.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONMASK_SHADOW_NO_ACCESS</name>
              <description>Asserted if access non-exist shadow register without mask. set 1 to clear.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
