Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FLEXIO_TRIG[%s]</name>
          <description>FLEXIO Input Connections</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>FLEXIO Input Trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>Selects CTIMER_C_INP0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>Selects CTIMER_C_INP1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>Selects CTIMER_C_INP2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>Selects CTIMER_C_INP3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>Selects SCT0_OUT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>Selects SCT0_OUT7</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>Selects SCT0_OUT8</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>Selects CTIMER0_MAT3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>Selects CTIMER1_MAT3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>Selects CTIMER2_MAT3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>Selects CTIMER3_MAT3</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>Selects CTIMER4_MAT3</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>Selects PINT0 boolean pattern-match output</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>Selects ACMP0 CMPO</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>Selects RTC_SS0 interrupt</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>Selects GPIO0 peripheral output channel 0 trigger</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>Selects GPIO0 peripheral output channel 1 trigger</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>Selects GPIO1 peripheral output channel 0 trigger</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>Selects GPIO1 peripheral output channel 1 trigger</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>Selects GPIO2 peripheral output channel 0 trigger</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>Selects GPIO2 peripheral output channel 1 trigger</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>Selects GPIO3 peripheral output channel 0 trigger</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>Selects GPIO3 peripheral output channel 1 trigger</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>Selects GPIO4 peripheral output channel 0 trigger</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>Selects GPIO4 peripheral output channel 1 trigger</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>Selects GPIO5 peripheral output channel 0 trigger</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>Selects GPIO5 peripheral output channel 1 trigger</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>Selects GPIO6 peripheral output channel 0 trigger</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>Selects GPIO6 peripheral output channel 1 trigger</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>Selects GPIO7 peripheral output channel 0 trigger</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>Selects GPIO7 peripheral output channel 1 trigger</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>Selects GPIO8 peripheral output channel 0 trigger</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>Selects GPIO8 peripheral output channel 1 trigger</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>Selects GPIO9 peripheral output channel 0 trigger</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>Selects GPIO9 peripheral output channel 1 trigger</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>Selects GPIO10 peripheral output channel 0 trigger</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>Selects GPIO10 peripheral output channel 1 trigger</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>Selects ITRC TMPR_OUT[0]</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>Selects ITRC TMPR_OUT[1]</description>
                  <value>0x27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
