Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>FC20FCLKSEL</name>
          <description>LP_FLEXCOMM20 Clock Source Select</description>
          <addressOffset>0xA60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>LP_FLEXCOMM20 Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>baseclk_sense</name>
                  <description>baseclk_sense</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_max</name>
                  <description>fro2_max</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro1_max</name>
                  <description>fro1_max</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wake_32k_clk</name>
                  <description>wake32k_clk</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_EN</name>
              <description>Clock MUX Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_sel_not_enable</name>
                  <description>Output of clkmux is gated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sel_enable</name>
                  <description>Enables output of clock mux.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC20FCLKDIV</name>
          <description>LP_FLEXCOMM20 Clock Divider</description>
          <addressOffset>0xA64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy Flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDER_IS_NOT_BUSY</name>
                  <description>The CLKOUT is outputted with the new divider value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDER_IS_BUSY</name>
                  <description>A change is being made to the divider value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET</name>
              <description>Divider Counter Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_not_reset</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_reset</name>
                  <description>Resets the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Divider Counter Halt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_not_halt</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_halt</name>
                  <description>Halts (stops) the divider counter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Request Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_ready</name>
                  <description>The change to the divider value has been finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexcomm_fclk_div_not_ready</name>
                  <description>A change is being made to the divider value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDIOVDD1CLKSEL</name>
          <description>VDD1_SENSE Audio Clock Source</description>
          <addressOffset>0xAA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Clock Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mclk_in</name>
                  <description>mclk_in</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>osc_clk</name>
                  <description>osc_clk</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dfro2_div8</name>
                  <description>fro2_div8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>audio_pll_pfd3</name>
                  <description>audio_pll_pfd3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
