Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>SHA_SEN_TCTRL0</name>
          <description>Shared VDD1_SENSE Domain Targets Low-power Control</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC0_STOP</name>
              <description>ADC0 Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0_STOP</name>
              <description>ACMP0 Stop</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MICFIL_STOP</name>
              <description>MICFIL Stop</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_B_LPREQ</name>
              <description>LPI2C15 Bus Low-power Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15_F_LPREQ</name>
              <description>LPI2C15 Function Low-power Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GDET3_LPREQ</name>
              <description>GDET3 Low-power Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_STOP</name>
              <description>RTC0 and RTC1 Stop</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVATE_CCTRL0</name>
          <description>Private Resources Controllers Low-power Control 0</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDMA2_STOP</name>
              <description>eDMA2 Stop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDMA3_STOP</name>
              <description>eDMA3 Stop</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVATE_TCTRL0</name>
          <description>Private Resources Target Low-power Control</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP_FLEXCOMM17__B_LPREQ</name>
              <description>LP_FLEXCOMM17 Bus Low-power Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM18__B_LPREQ</name>
              <description>LP_FLEXCOMM18 Bus Low-power Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM19__B_LPREQ</name>
              <description>LP_FLEXCOMM19 Bus Low-power Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM20__B_LPREQ</name>
              <description>LP_FLEXCOMM20 Bus Low-power Request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM17_F_LPREQ</name>
              <description>LP_FLEXCOMM17 Function Low-power Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM18_F_LPREQ</name>
              <description>LP_FLEXCOMM18 Function Low-power Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM19_F_LPREQ</name>
              <description>LP_FLEXCOMM19 Function Low-power Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_FLEXCOMM20_F_LPREQ</name>
              <description>LP_FLEXCOMM20 Function Low-power Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI3_LPREQ</name>
              <description>SAI3 Low-power Request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO8_LPREQ</name>
              <description>GPIO8 Low-power Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO9_LPREQ</name>
              <description>GPIO9 Low-power Request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO10_LPREQ</name>
              <description>GPIO10 Low-power Request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C2_STOP</name>
              <description>I3C2 Stop</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I3C3_STOP</name>
              <description>I3C3 Stop</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEND</name>
                  <description>Sends request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_MED_CSTAT0</name>
          <description>Media Domain Shared Controllers Low-power Status</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VGPU_LPACCEPT</name>
              <description>VGPU Low-power Accept Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_NOQACK</name>
                  <description>Not accept</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_LPACCEPT</name>
                  <description>Accept</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VGPU_IDLE</name>
              <description>VGPU Idle Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VGPU_QACTIVE</name>
                  <description>Not in Idle status, VGPU has operation to perform.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VGPU_NOQACTIVE</name>
                  <description>In Idle status, VGPU might accept low-power request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_STOP</name>
              <description>EZH-V Stop Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NOSTOPPED</name>
                  <description>Not in Stop status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_STOPPED</name>
                  <description>In Stop status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_HALT</name>
              <description>EZH-V Halt Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NOHALTED</name>
                  <description>Not in Halt status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_HALTED</name>
                  <description>In Halt status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_WAITING</name>
              <description>EZH-V Waiting Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NO_WAITING</name>
                  <description>Not in waiting status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_WAITING</name>
                  <description>In waiting status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EZHV_WAKEUP</name>
              <description>Wakeup Request from EZH-V</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EZHV_NO_WAKE</name>
                  <description>Not needs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZHV_WAKE_REQ</name>
                  <description>Needs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
