Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE25</name>
              <description>Nonsecure Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE26</name>
              <description>Nonsecure Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE27</name>
              <description>Nonsecure Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE28</name>
              <description>Nonsecure Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE29</name>
              <description>Nonsecure Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE30</name>
              <description>Nonsecure Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE31</name>
              <description>Nonsecure Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ICNS</name>
          <description>Interrupt Control Nonsecure</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSE0</name>
              <description>Nonsecure Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE1</name>
              <description>Nonsecure Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
