Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDY0</name>
              <description>Result FIFO 0 Ready Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW_THRESHOLD</name>
                  <description>Below watermark level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE_THRESHOLD</name>
                  <description>Above watermark level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF0</name>
              <description>Result FIFO 0 Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>No result FIFO 0 overflow occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW_DETECTED</name>
                  <description>At least one result FIFO 0 overflow occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY1</name>
              <description>Result FIFO1 Ready Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BELOW_THRESHOLD</name>
                  <description>Below watermark level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOVE_THRESHOLD</name>
                  <description>Above watermark level</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOF1</name>
              <description>Result FIFO1 Overflow Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_OVERFLOW</name>
                  <description>No result FIFO1 overflow occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERFLOW_DETECTED</name>
                  <description>At least one result FIFO1 overflow occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_INT</name>
              <description>Interrupt Flag for High Priority Trigger Exception</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NO_EXCEPTION</name>
                  <description>No trigger exceptions occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXCEPTION_DETECTED</name>
                  <description>Trigger exceptions occurred; acknowledgment is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_INT</name>
              <description>Interrupt Flag for Trigger Completion</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>FLAG_CLEAR</name>
                  <description>Either IE[TCOMP_IE] is 0 or no trigger sequences are complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETION_DETECTED</name>
                  <description>Trigger sequence completed; all data stored in the associated FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL_RDY</name>
              <description>Calibration Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SET</name>
                  <description>Calibration is incomplete or not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE_CAL_STEP_COMPLETED</name>
                  <description>Calibration complete</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ACTIVE</name>
              <description>ADC Active</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ACTIVE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Processing a conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGACT</name>
              <description>Trigger Active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_0</name>
                  <description>Trigger 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_1</name>
                  <description>Trigger 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Command Active</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMMAND_ACTIVE</name>
                  <description>No command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_1</name>
                  <description>Command 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_2</name>
                  <description>Command 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_3</name>
                  <description>Associated command number</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_4</name>
                  <description>Associated command number</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_5</name>
                  <description>Associated command number</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_6</name>
                  <description>Associated command number</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_7</name>
                  <description>Associated command number</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_8</name>
                  <description>Associated command number</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_9</name>
                  <description>Associated command number</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FWMIE0</name>
              <description>FIFO 0 Watermark Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFIE0</name>
              <description>Result FIFO 0 Overflow Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWMIE1</name>
              <description>FIFO1 Watermark Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFIE1</name>
              <description>Result FIFO1 Overflow Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEXC_IE</name>
              <description>Trigger Exception Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCOMP_IE</name>
              <description>Trigger Completion Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_0_COMPLETE_ENABLED</name>
                  <description>Enable for trigger source 0 only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1_COMPLETE_ENABLED</name>
                  <description>Enable for trigger source 1 only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_TRIGGER_COMPLETES_ENABLED</name>
                  <description>Enable trigger 0 and trigger 1 completion interrupts for both trigger sources</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DE</name>
          <description>DMA Enable</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FWMDE0</name>
              <description>FIFO 0 Watermark DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWMDE1</name>
              <description>FIFO1 Watermark DMA Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPRICTRL</name>
              <description>ADC Trigger Priority Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT_CURRENT_ON_PRIORITY</name>
                  <description>Abort the current conversion and start the new command specified by the trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISH_CURRENT_ON_PRIORITY</name>
                  <description>Stop the current command after completing the current conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISH_SEQUENCE_ON_PRIORITY</name>
                  <description>Complete the current command before servicing the higher-priority trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Voltage Reference Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPTION_1</name>
                  <description>Option 1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_2</name>
                  <description>Option 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_3</name>
                  <description>Option 3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRES</name>
              <description>Trigger Resume Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Do not resume or restart automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Resume or restart automatically</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCMDRES</name>
              <description>Trigger Command Resume</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Restart automatically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Resume command execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPT_EXDI</name>
              <description>High Priority Trigger Exception Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUDLY</name>
              <description>Power Up Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWREN</name>
              <description>ADC Analog Pre-Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PRE_ENABLED</name>
                  <description>Not pre-enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_ENABLED</name>
                  <description>Pre-enabled and ready to execute conversions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
