Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SDADC</name>
      <description>Sigma Delta Analog-to-Digital Converter</description>
      <groupName>SDADC</groupName>
      <baseAddress>0x4020D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTL_0</name>
          <description>ADC Control 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMP_ADCN_ENABLE</name>
              <description>Compensation ADCn Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N3_DIS</name>
                  <description>Disables for ADCn[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N3_EN</name>
                  <description>Enables for ADCn[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ADCP_ENABLE</name>
              <description>Compensation ADCp Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P3_DIS</name>
                  <description>Disables for ADCp[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_EN</name>
                  <description>Enables for ADCp[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_AN_ADCN</name>
              <description>Reset ADCn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCN_3_RST</name>
                  <description>Reset for ADCn[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCN_3_OP</name>
                  <description>Operational for ADCn[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_AN_ADCP</name>
              <description>Reset ADCp</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCP_3_RST</name>
                  <description>Reset for ADCp[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCP_3_OP</name>
                  <description>Operational for ADCp[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCN_POWER_ENABLE</name>
              <description>ADCn Power Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N3_DIS</name>
                  <description>Disables ADCn[3] and vin_n[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N3_EN</name>
                  <description>Enables ADCn[3] and vin_n[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCP_POWER_ENABLE</name>
              <description>ADCp Power Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P3_DIS</name>
                  <description>Disables ADCp[3] and vin_p[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_EN</name>
                  <description>Enables ADCp[3] and vin_p[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTL_1</name>
          <description>ADC Control 1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCLOOP_N_ANA_ENABLE</name>
              <description>DC Loop N Analog Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N3_DIS</name>
                  <description>Disables for ADCn[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N3_EN</name>
                  <description>Enables for ADCn[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCLOOP_P_ANA_ENABLE</name>
              <description>DC Loop P Analog Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P3_DIS</name>
                  <description>Disables for ADCp[3]</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_EN</name>
                  <description>Enables for ADCp[3]</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFF_ENABLE</name>
              <description>Diff Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC3_DIS</name>
                  <description>ADCp[3] and ADCn[3] in SE mode</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_EN</name>
                  <description>Configures ADCp[3] and ADCn[3] as differential pair input</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_CTL_2</name>
          <description>ADC Control 2</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SET_DITHER3</name>
              <description>Set Dither 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC3_DIS</name>
                  <description>Disables dither of ADCp[3] and ADCn[3].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_1</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_2</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_3</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_4</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_5</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_6</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_MAX</name>
                  <description>Maximum dither amplitude for ADCp[3] and ADCn[3]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_DITHER2</name>
              <description>Set Dither 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC2_DIS</name>
                  <description>Disables dither of ADCp[2] and ADCn[2]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_1</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_2</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_3</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_4</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_5</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_6</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_MAX</name>
                  <description>Maximum dither amplitude for ADCp[2] and ADCn[2]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_DITHER1</name>
              <description>Set Dither 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC1_DIS</name>
                  <description>Disables dither of ADCp[1] and ADCn[1]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_1</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_2</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_3</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_4</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_5</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_6</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_MAX</name>
                  <description>Maximum dither amplitude for ADCp[1] and ADCn[1]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SET_DITHER0</name>
              <description>Set Dither 0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0_DIS</name>
                  <description>Disables dither of ADCp[0] and ADCn[0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_1</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_2</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_3</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_4</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_5</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DITHER_6</name>
                  <description>The higher the value, the stronger the dither</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_MAX</name>
                  <description>Maximum dither amplitude for ADCp[0] and ADCn[0]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_CTL</name>
          <description>LDO Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_SETTING</name>
              <description>LDO Setting</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>To drive 1 SE or 1 Diff mode ADC (low power mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>To drive more than 1 ADCs</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_USE_2</name>
                  <description>Not in use</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_USE_3</name>
                  <description>Not in use</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_POWER_ENABLE</name>
              <description>LDO Power Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CTL</name>
          <description>Reference Control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x110000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAST_REF_ENABLE</name>
              <description>Fast Reference Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_0</name>
                  <description>267 ms (retain mode) when bit20=0 | 38 ms (low noise) when bit20=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_1</name>
                  <description>66.5 ms (low power) when bit20=0 | 1 ms (fast charging) when bit20=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWR_FAST_REF_ENABLE</name>
              <description>Power Fast Reference Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_0</name>
                  <description>267 ms (retain mode) when bit16=0 | 66.5 ms (low power) when bit16=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_1</name>
                  <description>38 ms (low noise) when bit16=0 | 1 ms (fast charging) when bit16=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REF_POWER_ENABLE</name>
              <description>Reference Power Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
