Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>LVDVDD1CTRL</name>
          <description>VDD1 LVD Control</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x281E140A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL0</name>
              <description>Level 0 Voltage</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL1</name>
              <description>Level 1 Voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVL2</name>
              <description>Level 2 Voltage</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL3</name>
              <description>Level 3 Voltage</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVL_0</name>
                  <description>0.50 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_1</name>
                  <description>0.66 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_2</name>
                  <description>0.82 V</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_3</name>
                  <description>0.98 V</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVL_4</name>
                  <description>1.13 V</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PORCTRL</name>
          <description>Power-on Reset Control</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VDD1LVL</name>
              <description>POR Level in VDD1 Domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDLVL_0</name>
                  <description>0.40 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_1</name>
                  <description>0.48 V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_2</name>
                  <description>0.56 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_3</name>
                  <description>0.64 V</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_4</name>
                  <description>0.72 V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD2LVL</name>
              <description>POR Level in VDD2 Domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDLVL_0</name>
                  <description>0.40 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_1</name>
                  <description>0.48 V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_2</name>
                  <description>0.56 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_3</name>
                  <description>0.64 V</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_4</name>
                  <description>0.72 V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDNLVL</name>
              <description>POR Level in VDDN Domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDLVL_0</name>
                  <description>0.40 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_1</name>
                  <description>0.48 V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_2</name>
                  <description>0.56 V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_3</name>
                  <description>0.64 V</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDLVL_4</name>
                  <description>0.72 V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BBCTRL</name>
          <description>Body Bias Control</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RBB1LVL</name>
              <description>Reverse Body Bias Voltage for VDD1 Domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBV1v</name>
                  <description>Voltage is set to 1.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBV1p3v</name>
                  <description>Voltage is set to 1.3 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBB2LVL</name>
              <description>Reverse Body Bias Voltage for VDD2 Domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBV1v</name>
                  <description>Voltage is set to 1.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBV1p3v</name>
                  <description>Voltage is set to 1.3 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBBNLVL</name>
              <description>Reverse Body Bias Voltage for VDDN Domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBBV1v</name>
                  <description>Voltage is set to 1.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBBV1p3v</name>
                  <description>Voltage is set to 1.3 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TSENSOR</name>
          <description>Temperature Sensor Control</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSENSM</name>
              <description>Temperature Sensor Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSENSM_0</name>
                  <description>Perform AD conversion and record C*_000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_1</name>
                  <description>Perform AD conversion and record C*_001</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_2</name>
                  <description>Perform AD conversion and record C*_010</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_3</name>
                  <description>Perform AD conversion and record C*_011</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_4</name>
                  <description>Perform AD conversion and record CM_100</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_5</name>
                  <description>Perform AD conversion and record C*_101</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_6</name>
                  <description>Perform AD conversion and record C*_110</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSENSM_7</name>
                  <description>Perform AD conversion and record C*_111</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP</name>
          <description>Wake-up Configuration for Compute Domain</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WAKETIME</name>
              <description>Wake-up Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKSRCEN</name>
              <description>Wake-up Source Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKSRCEN_0</name>
                  <description>Wake-up disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKSRCEN_1</name>
                  <description>Wake-up enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKSRCF</name>
              <description>Wake-up Source Flags</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKSRCF_0</name>
                  <description>No wake-up from source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKSRCF_1</name>
                  <description>Source has triggered a wake-up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
