Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Powers down RAM Partition 29 array and periphery</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSLEEPCFG3</name>
          <description>PD Sleep Configuration 3 in Sense Domain</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0</name>
              <description>RAM Partition 0 Periphery Power Down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1</name>
              <description>RAM Partition 1 Periphery Power Down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2</name>
              <description>RAM Partition 2 Periphery Power Down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3</name>
              <description>RAM Partition 3 Periphery Power Down</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4</name>
              <description>RAM Partition 4 Periphery Power Down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5</name>
              <description>RAM Partition 5 Periphery Power Down</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6</name>
              <description>RAM Partition 6 Periphery Power Down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM7</name>
              <description>RAM Partition 7 Periphery Power Down</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM8</name>
              <description>RAM Partition 8 Periphery Power Down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM9</name>
              <description>RAM Partition 9 Periphery Power Down</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM10</name>
              <description>RAM Partition 10 Periphery Power Down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM11</name>
              <description>RAM Partition 11 Periphery Power Down</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM12</name>
              <description>RAM Partition 12 Periphery Power Down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM13</name>
              <description>RAM Partition 13 Periphery Power Down</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM14</name>
              <description>RAM Partition 14 Periphery Power Down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM15</name>
              <description>RAM Partition 15 Periphery Power Down</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM16</name>
              <description>RAM Partition 16 Periphery Power Down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM17</name>
              <description>RAM Partition 17 Periphery Power Down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM18</name>
              <description>RAM Partition 18 Periphery Power Down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM19</name>
              <description>RAM Partition 19 Periphery Power Down</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM20</name>
              <description>RAM Partition 20 Periphery Power Down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM21</name>
              <description>RAM Partition 21 Periphery Power Down</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM22</name>
              <description>RAM Partition 22 Periphery Power Down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM23</name>
              <description>RAM Partition 23 Periphery Power Down</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM24</name>
              <description>RAM Partition 24 Periphery Power Down</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM25</name>
              <description>RAM Partition 25 Periphery Power Down</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM26</name>
              <description>RAM Partition 26 Periphery Power Down</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM27</name>
              <description>RAM Partition 27 Periphery Power Down</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM28</name>
              <description>RAM Partition 28 Periphery Power Down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM29</name>
              <description>RAM Partition 29 Periphery Power Down</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PER_ON</name>
                  <description>Power on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
