Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_ezhv.xml
        <register>
          <name>SENSE_AIPS_PERIPHERAL_ACCESS_ENABLE</name>
          <description>Access enable for SENSE domain masters to common AIPS peripherals.</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MU0_B</name>
              <description>Enable access to MU0_B</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU1_B</name>
              <description>Enable access to MU1_B</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MU2_B</name>
              <description>Enable access to MU2_B</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA42_0</name>
              <description>Enable access to SEMA42_0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSTIMER_ALIAS2</name>
              <description>Enable access to OSTIMER_ALIAS2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSTIMER_ALIAS3</name>
              <description>Enable access to OSTIMER_ALIAS3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0</name>
              <description>Enable access to ACMP0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>Enable access to ADC0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDADC</name>
              <description>Enable access to SDADC</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MICFIL</name>
              <description>Enable access to MICFIL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC1</name>
              <description>Enable access to PMC0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C15</name>
              <description>Enable access to LPI2C15</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNVALID</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_LEVEL</name>
          <description>Master Secure Level</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIFI1</name>
              <description>HIFI1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEDIA</name>
              <description>MEDIA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2</name>
              <description>DMA2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA3</name>
              <description>DMA3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER_SEC_ANTI_POL_REG</name>
          <description>Master Secure Level</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIFI1</name>
              <description>HIFI1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEDIA</name>
              <description>MEDIA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2</name>
              <description>DMA2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA3</name>
              <description>DMA3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_MASTER</name>
                  <description>Secure and privileged Master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_MASTER</name>
                  <description>Secure and non-privileged Master</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_MASTER</name>
                  <description>Non-secure and privileged Master</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_MASTER</name>
                  <description>Non-secure and non-privileged Master</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
